davidacat/aes67-esp32p4-module-dev-kit/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# L2 TAP for PTP
CONFIG_ESP_NETIF_L2_TAP=y

# PTP daemon: enable both client (slave) and server (grandmaster) roles
CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y

# PSRAM - ESP32-P4 has plenty
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# lwIP - multicast and buffer config for AES67
CONFIG_LWIP_IGMP=y
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_NETBUF_RECVINFO=y
CONFIG_LWIP_IP_DEFAULT_TTL=64

# mDNS
CONFIG_MDNS_MAX_SERVICES=8

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# System
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition - use larger app partition since we have plenty of flash
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=8

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# System
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
